{
 "backend": "tensorflow",
 "class_name": "Sequential",
 "config": {
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      30,
      1
     ],
     "dtype": "float32",
     "name": "lstm_4_input",
     "ragged": false,
     "sparse": false
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "batch_input_shape": [
      null,
      30,
      1
     ],
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_4",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_4",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_5",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_5",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_6",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_6",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_7",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": false,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_7",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "activation": "linear",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dtype": "float32",
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "dense_1",
     "trainable": true,
     "units": 1,
     "use_bias": true
    }
   }
  ],
  "name": "sequential_1"
 },
 "keras_version": "2.12.0",
 "weights": [
  [
   [
    0.16137602925300598,
    -0.1516999453306198,
    0.18617281317710876,
    0.19136682152748108,
    0.12772376835346222,
    0.15182749927043915,
    0.09154561161994934,
    -0.21526095271110535,
    0.08079713582992554,
    0.020585641264915466,
    -0.07355555891990662,
    0.1507110893726349,
    0.1834743320941925,
    0.1562882661819458,
    -0.09731912612915039,
    -0.008030605502426624,
    -0.1063387468457222,
    0.13447342813014984,
    0.10833185166120529,
    -0.09091924875974655,
    0.12778542935848236,
    0.15315818786621094,
    0.23288004100322723,
    0.10392066836357117,
    0.11759963631629944,
    0.04457239434123039,
    0.06451844424009323,
    0.28283974528312683,
    -0.062045592814683914,
    -0.13166554272174835,
    -0.12369897216558456,
    0.18986862897872925,
    -0.1592736542224884,
    0.06098612770438194,
    -0.06288385391235352,
    0.24944515526294708,
    0.07687897980213165,
    -0.04424389824271202,
    0.2271610051393509,
    0.06975498795509338,
    0.14009682834148407,
    0.2003481239080429,
    0.08701871335506439,
    -0.006585601717233658,
    0.07388376444578171,
    -0.00016540789511054754,
    -0.015292653813958168,
    0.21185001730918884,
    0.21013331413269043,
    0.1397591084241867,
    -0.037791792303323746,
    0.11848572641611099,
    -0.055159714072942734,
    0.07963771373033524,
    -0.02628074400126934,
    -0.09754946827888489,
    0.020508596673607826,
    -0.131759375333786,
    0.07503642141819,
    -0.00343507481738925,
    0.06668435037136078,
    0.06920419633388519,
    -0.12300052493810654,
    -0.184966042637825,
    -0.10462533682584763,
    -0.010394069366157055,
    -0.17680120468139648,
    0.015268980525434017,
    -0.15618279576301575,
    0.06057099625468254,
    0.11583936959505081,
    -0.11387497186660767,
    -0.02847076952457428,
    0.11867944896221161,
    -0.0597517266869545,
    -0.08981885761022568,
    -0.0801645815372467,
    -0.11729824542999268,
    -0.16019316017627716,
    0.10560765862464905,
    -0.04658667370676994,
    0.08381421864032745,
    0.0833580493927002,
    0.0535200797021389,
    -0.07010840624570847,
    -0.05745710805058479,
    -0.05009537190198898,
    -0.10921598970890045,
    -0.12131748348474503,
    -0.06825152784585953,
    -0.16388490796089172,
    0.04430164024233818,
    0.030031604692339897,
    -0.08010593056678772,
    0.05193997547030449,
    -0.06825192272663116,
    0.04611603915691376,
    0.050667572766542435,
    -0.1334640383720398,
    0.04372473061084747,
    -0.020133312791585922,
    0.12176620960235596,
    -0.11327550560235977,
    0.1554885059595108,
    -0.11749455332756042,
    -0.15676414966583252,
    -0.003563996171578765,
    0.030560413375496864,
    -0.15719197690486908,
    0.17029918730258942,
    0.17986106872558594,
    0.16600003838539124,
    0.23872585594654083,
    0.019409313797950745,
    0.14326804876327515,
    0.15866170823574066,
    -0.010776663199067116,
    -0.15207815170288086,
    0.14536267518997192,
    0.07674103230237961,
    -0.09440196305513382,
    -0.19534215331077576,
    0.13645510375499725,
    0.12047336250543594,
    0.15132613480091095,
    -0.07568103820085526,
    -0.18983078002929688,
    0.20382113754749298,
    -0.17518818378448486,
    0.1407107710838318,
    -0.047441914677619934,
    0.1335838884115219,
    -0.03255336731672287,
    0.15083520114421844,
    -0.13244575262069702,
    0.34545618295669556,
    -0.14991116523742676,
    0.06545428931713104,
    -0.1704186201095581,
    0.20124298334121704,
    -0.1482504904270172,
    -0.15871024131774902,
    -0.10028690844774246,
    0.18454846739768982,
    -0.1703290045261383,
    0.2512868344783783,
    0.15538471937179565,
    -0.06954749673604965,
    0.15702544152736664,
    -0.16020430624485016,
    -0.07583390921354294,
    -0.0431988462805748,
    0.18234269320964813,
    0.15297961235046387,
    0.14695124328136444,
    0.06352598965167999,
    -0.09053997695446014,
    0.11117738485336304,
    -0.029039772227406502,
    0.20565705001354218,
    -0.02873356081545353,
    0.01604795828461647,
    0.25959113240242004,
    0.06552556902170181,
    0.08619124442338943,
    0.246705561876297,
    0.024136459454894066,
    -0.024829410016536713,
    0.04469591751694679,
    -0.025847075507044792,
    0.21612684428691864,
    0.13557995855808258,
    0.2123345583677292,
    0.16514068841934204,
    0.23604370653629303,
    -0.10710889101028442,
    -0.09292753040790558,
    0.24096986651420593,
    0.17436915636062622,
    -0.07884667068719864,
    -0.04524925723671913,
    0.0981794074177742,
    0.10170985013246536,
    0.12822459638118744,
    0.0035774847492575645,
    0.284936785697937,
    0.21344012022018433,
    -0.056995708495378494,
    0.12940314412117004,
    0.17121091485023499,
    0.052817635238170624,
    0.14653851091861725,
    0.16402147710323334,
    0.19184733927249908,
    0.18031662702560425,
    -0.1323205828666687,
    0.13263769447803497,
    -0.08213033527135849,
    -0.05406204238533974,
    0.010847947560250759
   ]
  ],
  [
   [
    -0.07814402133226395,
    -0.007384825963526964,
    -0.046255044639110565,
    -0.1868065595626831,
    -0.02635863795876503,
    -0.2197771668434143,
    0.07996324449777603,
    0.22252923250198364,
    -0.03320566192269325,
    -0.22424498200416565,
    -0.0331227071583271,
    -0.03350066393613815,
    -0.043991778045892715,
    0.09077203273773193,
    -0.05674673244357109,
    0.04470909759402275,
    -0.0021869593765586615,
    0.05205068737268448,
    -0.06913544982671738,
    -0.021369509398937225,
    0.025126364082098007,
    -0.11692177504301071,
    -0.18518801033496857,
    -0.04656806215643883,
    0.06670764088630676,
    -0.022117504850029945,
    -0.0025243847630918026,
    -0.09875661134719849,
    -0.05063818395137787,
    0.04344235733151436,
    0.01720251701772213,
    -0.014260347001254559,
    0.06288112699985504,
    0.07329216599464417,
    -0.006799908354878426,
    -0.2500031590461731,
    -0.04500826448202133,
    -0.007313698064535856,
    -0.03202252835035324,
    -0.25138992071151733,
    -0.11004599183797836,
    -0.2403249442577362,
    0.09921044856309891,
    -0.04449924826622009,
    -0.03303823247551918,
    -0.19839461147785187,
    -0.06683643162250519,
    -0.11253397911787033,
    -0.027954356744885445,
    -0.018543416634202003,
    0.01908205635845661,
    -0.07420334219932556,
    0.041607290506362915,
    0.11630379408597946,
    0.17367564141750336,
    -0.03479020670056343,
    0.14739744365215302,
    0.07951629906892776,
    0.12007816135883331,
    -0.0833902582526207,
    -0.018602581694722176,
    0.06913663446903229,
    0.12129675596952438,
    -0.042236343026161194,
    0.09292762726545334,
    0.05998055264353752,
    -0.056918032467365265,
    0.061823345720767975,
    0.12223624438047409,
    -0.0361795648932457,
    -0.057552140206098557,
    0.10565035790205002,
    -0.02446874789893627,
    0.13115555047988892,
    0.1784111112356186,
    0.10298193991184235,
    -0.08644287288188934,
    0.1447165608406067,
    0.1878061294555664,
    -0.06456728279590607,
    0.016394788399338722,
    -0.12131314724683762,
    0.08438880741596222,
    0.06836844980716705,
    -0.0025799016002565622,
    0.05873347446322441,
    -0.0781189426779747,
    -0.003156655002385378,
    -0.055530499666929245,
    0.12122593075037003,
    0.00020619046699721366,
    0.04558805748820305,
    -0.06851116567850113,
    0.024280846118927002,
    0.05134079232811928,
    -0.19173090159893036,
    0.009294172748923302,
    -0.008834091946482658,
    -0.01005737017840147,
    -0.04956236109137535,
    0.12150438129901886,
    0.06874657422304153,
    -0.031058449298143387,
    0.03403927758336067,
    0.06623631715774536,
    -0.07177308201789856,
    0.039088234305381775,
    0.07549203932285309,
    -0.12755919992923737,
    -0.017967509105801582,
    0.08032739162445068,
    -0.010628622956573963,
    0.16002391278743744,
    -0.0700194239616394,
    0.04764874652028084,
    0.09678494930267334,
    0.047501835972070694,
    0.05438070744276047,
    0.11828789114952087,
    0.08910458534955978,
    0.08915088325738907,
    -0.14654281735420227,
    -0.01467258483171463,
    0.12983004748821259,
    0.15631473064422607,
    -0.044812362641096115,
    -0.03304945304989815,
    0.04892008379101753,
    -0.04373578727245331,
    0.060792677104473114,
    0.02432970143854618,
    0.10632219165563583,
    0.030540701001882553,
    0.03146687150001526,
    0.09684789180755615,
    0.12220271676778793,
    -0.08647079765796661,
    0.10595308244228363,
    -0.1316511482000351,
    0.05530809238553047,
    -0.05207928270101547,
    -0.13318422436714172,
    -0.05835063382983208,
    0.04163113236427307,
    -0.015797697007656097,
    -0.20784074068069458,
    -0.002440324518829584,
    -0.04687007516622543,
    0.042910587042570114,
    -0.05633389577269554,
    -0.029286686331033707,
    0.05349642038345337,
    -0.12198075652122498,
    -0.09464692324399948,
    -0.06406711041927338,
    -0.06940162181854248,
    0.055084794759750366,
    -0.027786532416939735,
    -0.1083497405052185,
    -0.05494851991534233,
    0.032422278076410294,
    -0.10117532312870026,
    -0.0315624363720417,
    0.1893949955701828,
    -0.009972400963306427,
    -0.26955902576446533,
    -0.0827825665473938,
    -0.07233566790819168,
    -0.11960842460393906,
    0.006233672145754099,
    -0.003651315113529563,
    -0.16282913088798523,
    -0.048061419278383255,
    0.05410489812493324,
    -0.06148582696914673,
    0.026701003313064575,
    -0.09239678084850311,
    0.010249228216707706,
    0.11125990748405457,
    0.03042222373187542,
    0.03669527918100357,
    -0.002125243889167905,
    0.04803530126810074,
    0.08982010185718536,
    -0.05111014097929001,
    -0.19907180964946747,
    0.15543091297149658,
    0.03228820115327835,
    -0.1829994171857834,
    -0.16326625645160675,
    -0.21997106075286865,
    -0.15951411426067352,
    -0.04355588182806969,
    0.024327922612428665,
    0.048423729836940765,
    0.017563752830028534,
    -0.0645967423915863,
    -0.16592156887054443,
    0.049132440239191055,
    0.044703856110572815
   ],
   [
    0.16546866297721863,
    0.020499849691987038,
    0.039601024240255356,
    0.10546872019767761,
    0.03117360547184944,
    0.03234336897730827,
    0.10831955075263977,
    0.07870625704526901,
    -0.12559950351715088,
    0.03533432260155678,
    0.008543525822460651,
    0.0744544267654419,
    0.05385228246450424,
    -0.07579551637172699,
    -0.02573922649025917,
    0.24282559752464294,
    0.038487136363983154,
    -0.007080745417624712,
    -0.053777776658535004,
    0.04900886118412018,
    -0.07569853961467743,
    0.3328692615032196,
    -0.06714753061532974,
    0.047293465584516525,
    0.016469143331050873,
    -0.0006705647683702409,
    -0.06430552899837494,
    0.1322869062423706,
    0.15033435821533203,
    0.052906304597854614,
    0.047000352293252945,
    -0.0003283669357188046,
    -0.05484500154852867,
    -0.005153028294444084,
    0.04903564602136612,
    0.6369602084159851,
    0.062056735157966614,
    0.002082710387185216,
    0.11349697411060333,
    0.2979544997215271,
    0.22475290298461914,
    0.23231975734233856,
    -0.06516549736261368,
    0.10157281905412674,
    0.06704633682966232,
    0.16622404754161835,
    -0.019166890531778336,
    0.07364432513713837,
    0.027337810024619102,
    0.07253003120422363,
    0.07326645404100418,
    -0.040857944637537,
    0.08694341778755188,
    -0.2367413192987442,
    0.0064588370732963085,
    0.03145932778716087,
    0.0738937258720398,
    0.03917950019240379,
    -0.05931715667247772,
    -0.029420390725135803,
    -0.07356027513742447,
    -0.09683398902416229,
    -0.06012416258454323,
    0.02520904876291752,
    -0.011205342598259449,
    -0.04730316624045372,
    -0.01278019230812788,
    -0.029020553454756737,
    0.03271455317735672,
    0.08138156682252884,
    -0.11212509870529175,
    -0.04745832085609436,
    -0.07059508562088013,
    -0.11687562614679337,
    -0.009126298129558563,
    -0.0033800427336245775,
    -0.005704391747713089,
    -0.1239609569311142,
    0.022518040612339973,
    0.10285456478595734,
    0.15552645921707153,
    0.06015893071889877,
    -0.041970059275627136,
    0.09915417432785034,
    -0.03213153034448624,
    -0.138358011841774,
    0.009788266383111477,
    0.03444381058216095,
    -0.042574938386678696,
    -0.0741085410118103,
    -0.08176518976688385,
    -0.1419232040643692,
    -0.026756731793284416,
    -0.17153242230415344,
    0.07753675431013107,
    0.14958307147026062,
    -0.06177515536546707,
    -0.008128879591822624,
    -0.078843854367733,
    -0.042546238750219345,
    -0.08828601241111755,
    -0.13188256323337555,
    0.14019130170345306,
    -0.021277518942952156,
    -0.011057929135859013,
    0.0605224072933197,
    -0.0740581601858139,
    -0.048103101551532745,
    -0.003682496026158333,
    0.018463553860783577,
    0.05364614725112915,
    -0.007353051565587521,
    -0.09717182070016861,
    0.1540805995464325,
    -0.1295841932296753,
    -0.13151860237121582,
    0.13679930567741394,
    0.11770578473806381,
    0.0033000686671584845,
    -0.07465983927249908,
    0.005364453420042992,
    0.16893699765205383,
    -0.07326846569776535,
    -0.04387422278523445,
    0.04029148817062378,
    -0.13205905258655548,
    0.06285932660102844,
    -0.08453113585710526,
    0.029919594526290894,
    -0.0837351530790329,
    -0.0776607021689415,
    -0.03223023936152458,
    0.013426500372588634,
    0.024881035089492798,
    0.022845786064863205,
    -0.05335535109043121,
    -0.021565789356827736,
    -0.040472857654094696,
    0.11603443324565887,
    -0.11326268315315247,
    -0.009807518683373928,
    0.04087961092591286,
    0.04020027816295624,
    0.09725485742092133,
    -0.03804006800055504,
    -0.02524244785308838,
    0.024656575173139572,
    0.06493350118398666,
    -0.1590951681137085,
    -0.09101440012454987,
    0.10246692597866058,
    0.06884346902370453,
    -0.13811254501342773,
    -0.10504059493541718,
    0.1106342077255249,
    0.07486158609390259,
    0.15657907724380493,
    0.023950358852744102,
    0.08492308109998703,
    0.11280462145805359,
    0.07104607671499252,
    -0.02379692532122135,
    0.034551676362752914,
    0.17159532010555267,
    0.009975403547286987,
    0.051826588809490204,
    0.08405453711748123,
    0.03901815414428711,
    0.10829398781061172,
    -0.036368340253829956,
    0.03600652888417244,
    0.3828684687614441,
    0.0051867724396288395,
    -0.09599287807941437,
    -0.10960549861192703,
    -0.05602842569351196,
    0.06344573199748993,
    0.04578657075762749,
    -0.1619357019662857,
    0.027941515669226646,
    0.022407297044992447,
    0.11678899824619293,
    0.06196637451648712,
    0.023124156519770622,
    -0.021377762779593468,
    0.5743831992149353,
    -0.16818535327911377,
    0.15798485279083252,
    -0.008059020154178143,
    0.1020108014345169,
    0.061992865055799484,
    0.24814721941947937,
    0.0008323951042257249,
    0.04456822946667671,
    0.09991075843572617,
    -0.04575704038143158,
    -0.0010824011405929923,
    0.1922370344400406,
    0.010097241029143333,
    -0.009466494433581829
   ],
   [
    -0.05731935799121857,
    0.13007275760173798,
    0.004233541898429394,
    -0.13165681064128876,
    -0.08001317828893661,
    -0.0416693352162838,
    0.17717620730400085,
    0.07665304839611053,
    -0.007933231070637703,
    -0.010117173194885254,
    -0.08991635590791702,
    -0.02253221720457077,
    -0.2998334467411041,
    -0.020711634308099747,
    0.03762964531779289,
    -0.09173169732093811,
    -0.13594722747802734,
    0.06278825551271439,
    -0.007103584241122007,
    0.05794370919466019,
    -0.0901845395565033,
    -0.15437129139900208,
    -0.16173160076141357,
    -0.10374590009450912,
    -0.06273417919874191,
    0.09938317537307739,
    0.05220817029476166,
    -0.04506109282374382,
    0.016908923164010048,
    0.1719820499420166,
    0.044370267540216446,
    -0.0375756099820137,
    0.11470276862382889,
    0.1893642395734787,
    -0.18493106961250305,
    -0.11884844303131104,
    -0.017917977645993233,
    0.032262906432151794,
    -0.06675562262535095,
    -0.16242094337940216,
    -0.15402968227863312,
    -0.1119537204504013,
    0.05547488108277321,
    -0.00870145857334137,
    -0.040708716958761215,
    -0.10530757158994675,
    0.07990846037864685,
    -0.09208136796951294,
    -0.13852547109127045,
    0.0021812787745147943,
    -0.11509250104427338,
    -0.048144951462745667,
    0.025092920288443565,
    0.027160340920090675,
    -0.013393723405897617,
    -0.027212131768465042,
    0.022714244201779366,
    -0.07564596831798553,
    -0.11342285573482513,
    0.04167008772492409,
    -0.0995076447725296,
    0.018350878730416298,
    -0.029868660494685173,
    0.08980363607406616,
    -0.008903137408196926,
    -0.0065180459059774876,
    0.04141087830066681,
    0.014804667793214321,
    -0.1193234995007515,
    -0.07946959882974625,
    0.10482791066169739,
    -0.058478426188230515,
    -0.03690763935446739,
    0.10447102785110474,
    0.04417647048830986,
    0.007529475260525942,
    0.09012357890605927,
    -0.002430067863315344,
    -0.057962529361248016,
    0.029262788593769073,
    -0.06998647749423981,
    0.1150902658700943,
    0.040179893374443054,
    -0.025063036009669304,
    -0.06600018590688705,
    0.11980944126844406,
    -0.043367791920900345,
    -0.011916281655430794,
    -0.06672628223896027,
    0.02383209392428398,
    0.08002779632806778,
    -0.0789121761918068,
    -0.010204656980931759,
    -0.00747627904638648,
    -0.04705909639596939,
    -0.03147538751363754,
    -0.020207077264785767,
    0.04928971827030182,
    0.05206020548939705,
    0.06578044593334198,
    0.08071593940258026,
    0.060353342443704605,
    -0.03142795339226723,
    -0.10098890960216522,
    0.04728350788354874,
    -0.06011906638741493,
    -0.04929644986987114,
    -0.030532976612448692,
    -0.008844186551868916,
    -0.00639432854950428,
    -0.011609517969191074,
    -0.12488723546266556,
    0.004230017773807049,
    -0.054397791624069214,
    0.07628501206636429,
    0.11204758286476135,
    0.053560081869363785,
    0.0586509145796299,
    0.034862954169511795,
    -0.08345803618431091,
    -0.10872124135494232,
    0.1129518449306488,
    -0.0018931878730654716,
    -0.06631980836391449,
    0.0635407567024231,
    0.07242985814809799,
    -0.07933562994003296,
    0.0057585230097174644,
    -0.10593240708112717,
    -0.08226252347230911,
    0.012763548642396927,
    0.0803496390581131,
    -0.026170829311013222,
    0.019375981763005257,
    -0.13128142058849335,
    0.10481356084346771,
    -0.0796552523970604,
    0.12172836065292358,
    0.0004662318679038435,
    0.05355507507920265,
    -0.0955597460269928,
    0.020130258053541183,
    0.04356520250439644,
    0.023624809458851814,
    -0.02051791176199913,
    -0.06190425902605057,
    -0.04871426522731781,
    0.019044319167733192,
    0.0847468450665474,
    -0.16074486076831818,
    0.1174560934305191,
    -0.06375850737094879,
    -0.008293787017464638,
    -0.06840529292821884,
    -0.16265901923179626,
    -0.12139176577329636,
    0.06819624453783035,
    -0.011279650963842869,
    -0.09391912817955017,
    -0.05037608742713928,
    -0.16939373314380646,
    -0.2596311569213867,
    -0.3164633512496948,
    0.16423173248767853,
    -0.005528885405510664,
    -0.16128335893154144,
    0.16293871402740479,
    -0.04746244475245476,
    -0.19114425778388977,
    -0.04604639112949371,
    0.12505552172660828,
    -0.1352817863225937,
    -0.02777969092130661,
    -0.07185960561037064,
    -0.06627170741558075,
    0.07492269575595856,
    -0.008964811451733112,
    -0.20780399441719055,
    0.00015437559341080487,
    -0.020645011216402054,
    0.03044411540031433,
    -0.07487071305513382,
    0.06957609951496124,
    0.011957541108131409,
    -0.13780492544174194,
    0.003660490270704031,
    0.02967863157391548,
    0.0857713595032692,
    0.057381391525268555,
    -0.0901777595281601,
    -0.18742555379867554,
    -0.20207014679908752,
    -0.018500670790672302,
    -0.01750926859676838,
    -0.15317176282405853,
    -0.02562565542757511,
    0.0917859673500061,
    -0.026546785607933998,
    -0.10482404381036758,
    -0.15080976486206055
   ],
   [
    0.1033329889178276,
    -0.029503710567951202,
    0.010680114850401878,
    0.08984395861625671,
    0.013382267206907272,
    0.2323104441165924,
    -0.012431157752871513,
    -0.002557642525061965,
    0.12957626581192017,
    -0.06859048455953598,
    0.16228269040584564,
    -0.08246432989835739,
    0.0761314257979393,
    0.057886239141225815,
    -0.0322396419942379,
    0.15738144516944885,
    0.03298031911253929,
    0.16196200251579285,
    -0.013680137693881989,
    0.059828974306583405,
    -0.04132790490984917,
    0.12745854258537292,
    -0.009563075378537178,
    -0.06516745686531067,
    0.05452840402722359,
    0.07710277289152145,
    0.047303617000579834,
    0.06546252965927124,
    0.12420300394296646,
    -0.018411586061120033,
    -0.08138319849967957,
    -0.04045529291033745,
    0.021942639723420143,
    0.015346342697739601,
    0.06110495701432228,
    0.17969122529029846,
    -0.03827301785349846,
    0.01290331594645977,
    0.06615903228521347,
    0.11917459219694138,
    0.17403176426887512,
    0.16989925503730774,
    -0.14353260397911072,
    0.017976224422454834,
    0.03760595619678497,
    0.11641760170459747,
    0.19872498512268066,
    0.0037003112956881523,
    0.06630983203649521,
    -0.06510239094495773,
    -0.018541058525443077,
    0.05621274933218956,
    -0.09962784498929977,
    0.039406999945640564,
    -0.0066466499119997025,
    -0.1037813052535057,
    0.018566234037280083,
    0.06182781234383583,
    0.036701884120702744,
    0.013368354178965092,
    0.03874952718615532,
    0.04271906241774559,
    0.0582265630364418,
    -0.008338507264852524,
    0.009542172774672508,
    0.04228058457374573,
    -0.01117127388715744,
    -0.17159759998321533,
    -0.05976443737745285,
    0.04016396775841713,
    -0.0724506825208664,
    -0.07986482977867126,
    0.07880854606628418,
    0.003395636798813939,
    0.0014168015914037824,
    -0.1074402704834938,
    -0.06988990306854248,
    -0.08420256525278091,
    -0.09425650537014008,
    0.15226435661315918,
    -0.041420575231313705,
    -0.015677616000175476,
    -0.025203131139278412,
    -0.017748447135090828,
    0.004645436070859432,
    -0.09024977684020996,
    0.0002883558045141399,
    0.01528059970587492,
    0.06298551708459854,
    0.1233486458659172,
    0.11369338631629944,
    -0.006206613499671221,
    -0.00110426580067724,
    0.02811087854206562,
    0.0047546569257974625,
    0.0628272145986557,
    0.08590246737003326,
    -0.02121022902429104,
    0.0003987809468526393,
    -0.04601875692605972,
    -0.09520360082387924,
    0.07255624979734421,
    0.06772264838218689,
    -0.04637354984879494,
    0.06442104279994965,
    -0.1280946433544159,
    0.042444828897714615,
    -0.08974867314100266,
    0.054533474147319794,
    -0.05209239944815636,
    -0.07819763571023941,
    -0.0548088476061821,
    -0.004963397979736328,
    0.11273001879453659,
    -0.169060617685318,
    -0.12288940697908401,
    0.14421719312667847,
    -0.11869700998067856,
    -0.00108137761708349,
    -0.04749946668744087,
    -0.02596537582576275,
    0.028076590970158577,
    0.051776327192783356,
    -0.2007756531238556,
    -0.03675917163491249,
    -0.06780814379453659,
    0.007341228425502777,
    -0.0545751191675663,
    0.136276975274086,
    0.1300887167453766,
    -0.058759186416864395,
    -0.28925621509552,
    0.08220580220222473,
    0.02462339960038662,
    -0.03500025346875191,
    0.08984699100255966,
    0.099825419485569,
    -0.008902542293071747,
    0.05309278890490532,
    -0.12496233731508255,
    0.1630551964044571,
    0.050299543887376785,
    -0.0013259418774396181,
    -0.024878980591893196,
    0.05561133474111557,
    0.11131977289915085,
    0.03573384881019592,
    0.058897215873003006,
    0.07506363838911057,
    0.004118300508707762,
    -0.15278926491737366,
    0.01660587452352047,
    0.023485204204916954,
    -0.013575227931141853,
    -0.07074694335460663,
    0.2941427230834961,
    -0.08638638257980347,
    -0.05239023268222809,
    0.06803935766220093,
    0.05411342903971672,
    0.11394449323415756,
    0.053076475858688354,
    0.1339283287525177,
    -0.0052012973465025425,
    -0.12111040204763412,
    0.10060003399848938,
    0.10898731648921967,
    0.09916382282972336,
    0.09637197107076645,
    0.03806799650192261,
    -0.01737402379512787,
    0.250606507062912,
    0.09163674712181091,
    -0.04373298957943916,
    -0.06795339286327362,
    -0.07077496498823166,
    -0.024005305022001266,
    0.21405620872974396,
    0.08536604046821594,
    0.08426141738891602,
    -0.015016444958746433,
    0.026811674237251282,
    -0.12329708784818649,
    0.007995295338332653,
    0.01205891277641058,
    0.2100362628698349,
    0.06606132537126541,
    0.028641318902373314,
    0.013302423059940338,
    0.09166625142097473,
    0.2004583179950714,
    0.1588267832994461,
    0.06583494693040848,
    0.05788100138306618,
    0.14758943021297455,
    0.014596834778785706,
    0.012958127073943615,
    0.006414462812244892,
    0.1375264972448349,
    0.23777297139167786
   ],
   [
    -0.045022692531347275,
    -0.069532111287117,
    0.002587952185422182,
    -0.08785320073366165,
    -0.04394017532467842,
    -0.18331381678581238,
    0.0906330943107605,
    0.08712606132030487,
    -0.06502358615398407,
    -0.1001061499118805,
    0.029312489554286003,
    0.017139218747615814,
    -0.059196773916482925,
    0.07442301511764526,
    -0.02331254631280899,
    -0.24201521277427673,
    0.05617021769285202,
    -0.10051769763231277,
    -0.11638572812080383,
    0.0542566254734993,
    -0.10090295970439911,
    -0.10251716524362564,
    0.01171645987778902,
    -0.06880652159452438,
    -0.12460381537675858,
    0.15946997702121735,
    -0.13047508895397186,
    -0.05602440983057022,
    -0.12898306548595428,
    -0.009367413818836212,
    0.14256837964057922,
    0.12089869379997253,
    0.030693620443344116,
    -0.021031996235251427,
    -0.08228537440299988,
    -0.0759035274386406,
    0.046324778348207474,
    0.024330880492925644,
    -0.01058721449226141,
    -0.02376011200249195,
    -0.10505034774541855,
    -0.20493856072425842,
    -0.027616169303655624,
    -0.1067642793059349,
    -0.06711052358150482,
    -0.03702066093683243,
    -0.03825174272060394,
    -0.12424152344465256,
    -0.006605688948184252,
    -0.049363698810338974,
    -0.12145794928073883,
    -0.005137166008353233,
    -0.04047050699591637,
    -0.021567802876234055,
    0.043804287910461426,
    -0.09771660715341568,
    0.029830731451511383,
    0.05135897919535637,
    -0.10625593364238739,
    -0.027117222547531128,
    -0.09741299599409103,
    0.0009543628548271954,
    -0.04177960380911827,
    0.06500886380672455,
    0.08020053058862686,
    0.10550891607999802,
    0.05766984447836876,
    0.06955009698867798,
    -0.05705929175019264,
    0.0864046961069107,
    0.013570346869528294,
    -0.05153286084532738,
    0.15673258900642395,
    -0.071778304874897,
    -0.0434807725250721,
    0.1028776690363884,
    0.0033082771115005016,
    -0.059697311371564865,
    0.17599143087863922,
    -0.18330252170562744,
    0.09429063647985458,
    0.0040708668529987335,
    0.024607805535197258,
    -0.17203792929649353,
    -0.1659466177225113,
    0.14972460269927979,
    -0.043167226016521454,
    -0.01893184706568718,
    -0.003707539290189743,
    -0.06657789647579193,
    0.04245680943131447,
    -0.04083052650094032,
    0.07349555939435959,
    -0.07890517264604568,
    -0.07246198505163193,
    -0.030252724885940552,
    -0.16339224576950073,
    -0.1072060614824295,
    0.0943378359079361,
    0.006214671768248081,
    0.13455097377300262,
    0.16865205764770508,
    0.09856312721967697,
    0.016608936712145805,
    -0.01703941822052002,
    -0.058493055403232574,
    -0.015348103828728199,
    -0.019563600420951843,
    0.06208544969558716,
    0.011732460930943489,
    -0.0617852546274662,
    -0.002728384220972657,
    0.03181878477334976,
    -0.10589420050382614,
    -0.07542731612920761,
    0.07886496186256409,
    -0.04788345843553543,
    0.012998941354453564,
    0.026388414204120636,
    0.009248647838830948,
    -0.1086941733956337,
    -0.014113657176494598,
    -0.01292874850332737,
    0.0020016508642584085,
    -0.050660014152526855,
    -0.036780744791030884,
    -0.04144898056983948,
    0.041401829570531845,
    -0.17286768555641174,
    -0.010495351627469063,
    -0.020749017596244812,
    0.04751068726181984,
    0.12604010105133057,
    -0.06607574224472046,
    -0.08116677403450012,
    0.05712557211518288,
    -0.22860844433307648,
    0.14719338715076447,
    -0.04979478567838669,
    -0.0008836104534566402,
    -0.07176043838262558,
    -0.047903213649988174,
    0.07483712583780289,
    0.07744311541318893,
    -0.1553867608308792,
    -0.0261202584952116,
    -0.04446292296051979,
    -0.00345109635964036,
    0.03021179884672165,
    0.019796323031187057,
    -0.15341754257678986,
    0.045792486518621445,
    0.07799442857503891,
    -0.11831485480070114,
    -0.03765590116381645,
    -0.14104311168193817,
    0.0945582464337349,
    0.004012094810605049,
    -0.06608126312494278,
    -0.030593885108828545,
    0.05287962034344673,
    0.03724147379398346,
    0.06718919426202774,
    0.0716138556599617,
    0.06181550770998001,
    -0.20312611758708954,
    -0.07076843082904816,
    0.012761490419507027,
    -0.11873486638069153,
    -0.13197238743305206,
    0.07805822789669037,
    -0.17127461731433868,
    -0.0366380475461483,
    -0.014730759896337986,
    -0.041512902826070786,
    0.015598444268107414,
    -0.17166543006896973,
    -0.09931563585996628,
    -0.062114961445331573,
    -0.1785389930009842,
    0.09692195802927017,
    -0.1511467695236206,
    0.06544308364391327,
    -0.01400771364569664,
    -0.12379404902458191,
    -0.15203626453876495,
    0.007161786314100027,
    -0.11899672448635101,
    -0.08595077693462372,
    -0.19879059493541718,
    -0.12273211777210236,
    -0.12215099483728409,
    0.03237590193748474,
    -0.08874639868736267,
    -0.06775739789009094,
    0.0478777214884758,
    -0.02502109296619892,
    -0.12043003737926483,
    -0.044622138142585754,
    -0.027026230469346046
   ],
   [
    -0.2218853086233139,
    0.01550808735191822,
    0.02703693136572838,
    0.034642044454813004,
    -0.06192321702837944,
    -0.03962044045329094,
    0.09565926343202591,
    0.10603806376457214,
    -0.05706075578927994,
    -0.006591363810002804,
    -0.037632349878549576,
    -0.1058155745267868,
    -0.13454654812812805,
    -0.035463083535432816,
    -0.054216306656599045,
    -0.13113635778427124,
    0.04835847020149231,
    -0.044915422797203064,
    -0.03270198777318001,
    -0.09780997037887573,
    0.048732105642557144,
    -0.0019516026368364692,
    -0.077690988779068,
    -0.010364177636802197,
    -0.12223252654075623,
    -0.024493571370840073,
    0.01085486076772213,
    -0.04714381694793701,
    -0.12613028287887573,
    -0.1792948842048645,
    -0.05786510929465294,
    -0.029906608164310455,
    0.14674828946590424,
    -0.011452021077275276,
    -0.051072679460048676,
    -0.2889595627784729,
    -0.027865521609783173,
    -0.036617450416088104,
    -0.007170100696384907,
    -0.18145817518234253,
    -0.11120449751615524,
    -0.17273014783859253,
    -0.037475116550922394,
    0.05925866216421127,
    -0.01688774861395359,
    -0.1434614360332489,
    -0.07728403806686401,
    -0.31903454661369324,
    -0.20682589709758759,
    0.004059637896716595,
    -0.04925880953669548,
    0.11037001758813858,
    -0.13706183433532715,
    0.0987786278128624,
    0.0793750137090683,
    0.03554980456829071,
    -0.023721886798739433,
    -0.11348386108875275,
    0.0639486089348793,
    -0.006137814838439226,
    -0.021616054698824883,
    -0.06149161607027054,
    -0.10071151703596115,
    -0.04727831855416298,
    0.04973961412906647,
    -0.073447585105896,
    -0.006196863017976284,
    0.18307407200336456,
    -0.04653981700539589,
    -0.02301417849957943,
    0.10727955400943756,
    0.07144761085510254,
    0.022507553920149803,
    -0.08084387332201004,
    -0.1061171442270279,
    0.05713674798607826,
    -0.03867700323462486,
    -0.09253352135419846,
    0.19948595762252808,
    0.06037122756242752,
    -0.021255822852253914,
    0.08553169667720795,
    0.030058642849326134,
    0.01916475221514702,
    0.030116256326436996,
    -0.09690774232149124,
    -0.07231369614601135,
    0.015296125784516335,
    -0.03462504968047142,
    -0.05205610767006874,
    -0.06851408630609512,
    0.14380797743797302,
    -0.07766599208116531,
    -0.12523755431175232,
    -0.04123867675662041,
    -0.13974237442016602,
    -0.17488440871238708,
    -0.12065791338682175,
    0.07286861538887024,
    0.0017398996278643608,
    0.1145196259021759,
    -0.007611553650349379,
    -0.17695793509483337,
    0.09302232414484024,
    -0.014161607250571251,
    -0.32556602358818054,
    -0.008790344931185246,
    0.17502425611019135,
    -0.0006636545876972377,
    0.01701660454273224,
    -0.02903958223760128,
    0.014242932200431824,
    -0.029960380867123604,
    -0.07599844038486481,
    0.008096777833998203,
    0.029776370152831078,
    -0.007741149514913559,
    -0.026471836492419243,
    0.04895315691828728,
    -0.020533008500933647,
    0.0142302131280303,
    -0.007975068874657154,
    -0.020274287089705467,
    0.015775062143802643,
    0.02174101211130619,
    -0.09022559225559235,
    0.099362313747406,
    0.031202947720885277,
    -0.17401021718978882,
    -0.14254987239837646,
    0.12381574511528015,
    0.08464248478412628,
    -0.04283742234110832,
    -0.021912898868322372,
    0.13733847439289093,
    0.024249952286481857,
    -0.005121693015098572,
    0.10496737062931061,
    -0.08157743513584137,
    -0.04175373166799545,
    0.023896465077996254,
    -0.10246208310127258,
    -0.012568940408527851,
    0.011565331369638443,
    -0.07403521984815598,
    -0.18050283193588257,
    -0.09047387540340424,
    -0.11144912987947464,
    0.05118098109960556,
    -0.0023387507535517216,
    0.006558367516845465,
    -0.12446695566177368,
    -0.07393057644367218,
    -0.07945214956998825,
    -0.09713534265756607,
    -0.04574475809931755,
    0.07864437997341156,
    -0.013186376541852951,
    0.0032145942095667124,
    -0.03371575474739075,
    -0.17625173926353455,
    -0.1639249175786972,
    -0.20991696417331696,
    0.005116226617246866,
    -0.025042276829481125,
    -0.09744615107774734,
    -0.08541499823331833,
    -0.04659605026245117,
    -0.13641750812530518,
    -0.12546351552009583,
    -0.04159332439303398,
    -0.056744638830423355,
    -0.21209445595741272,
    -0.01698538102209568,
    -0.18831540644168854,
    -0.0022575771436095238,
    0.07278182357549667,
    -0.2815065383911133,
    -0.11233764886856079,
    -0.24556978046894073,
    0.05222387611865997,
    -0.06870392709970474,
    0.07469252496957779,
    -0.13305146992206573,
    -0.08258789777755737,
    -0.26183953881263733,
    -0.03998369723558426,
    0.10739442706108093,
    0.0362861305475235,
    -0.026712585240602493,
    -0.18552015721797943,
    -0.13432645797729492,
    -0.09599041193723679,
    -0.18756085634231567,
    0.06977108865976334,
    -0.07208039611577988,
    0.0405777245759964,
    -0.204899400472641,
    -0.040967538952827454,
    -0.05465422570705414
   ],
   [
    -0.0171361044049263,
    0.050286080688238144,
    0.06911171227693558,
    0.07256731390953064,
    0.005828855559229851,
    0.055394720286130905,
    -0.0797872319817543,
    -0.004729165695607662,
    0.008124112151563168,
    -0.0760292038321495,
    0.13796330988407135,
    0.049922309815883636,
    0.14470331370830536,
    0.019968081265687943,
    0.09677363187074661,
    0.009297182783484459,
    -0.15089628100395203,
    -0.05778219550848007,
    0.06913973391056061,
    0.02068304643034935,
    0.027800776064395905,
    0.19044175744056702,
    -0.11358103901147842,
    -0.11707232147455215,
    -0.06139100715517998,
    0.06225180625915527,
    0.06363261491060257,
    0.04733942076563835,
    0.029283316805958748,
    0.030761167407035828,
    0.1163729727268219,
    -0.03068772703409195,
    -0.17503608763217926,
    0.10172252357006073,
    -0.025905417278409004,
    -0.005954455584287643,
    -0.09290998429059982,
    0.061218421906232834,
    0.06805712729692459,
    -0.0903506726026535,
    0.01442350260913372,
    0.07451280206441879,
    -0.07016052305698395,
    0.02677874080836773,
    0.02028852328658104,
    -0.11594092845916748,
    0.0518539622426033,
    0.022342097014188766,
    -0.02051813155412674,
    -0.07915915548801422,
    0.05826684832572937,
    -0.023349901661276817,
    0.055955976247787476,
    -0.00017032491450663656,
    0.03812679275870323,
    -0.00655672512948513,
    -0.1024593710899353,
    -0.011642769910395145,
    -0.102328822016716,
    0.05330013483762741,
    0.029415911063551903,
    0.08307352662086487,
    -0.042002830654382706,
    -0.18004167079925537,
    -0.1897413730621338,
    0.14594437181949615,
    -0.03754851594567299,
    -6.24307940597646e-05,
    -0.03338387608528137,
    -0.035085175186395645,
    -0.12570929527282715,
    0.21090129017829895,
    0.012164165265858173,
    -0.07957878708839417,
    0.09141062945127487,
    -0.12196966260671616,
    0.03744758293032646,
    0.04859808087348938,
    0.02593538723886013,
    -0.11131180822849274,
    -0.02381480112671852,
    -0.0268330667167902,
    -0.14121577143669128,
    -0.1334947794675827,
    0.03042217716574669,
    0.0042331465519964695,
    0.015196142718195915,
    0.02461404725909233,
    -0.04171247035264969,
    0.13331395387649536,
    -0.006634638179093599,
    0.06741401553153992,
    0.14215300977230072,
    0.05047600343823433,
    0.08647312223911285,
    0.0199885256588459,
    0.07576024532318115,
    0.024184096604585648,
    0.04727500304579735,
    0.0059648663736879826,
    -0.010553411208093166,
    0.0964226946234703,
    -0.017390193417668343,
    -0.07394109666347504,
    -0.03261946141719818,
    -0.012045404873788357,
    -0.13318060338497162,
    -0.009847475215792656,
    0.06625466048717499,
    -0.04336922615766525,
    0.07319726794958115,
    0.0925648882985115,
    0.004459959454834461,
    -0.02194821834564209,
    0.012603548355400562,
    0.017990846186876297,
    0.001477816142141819,
    -0.08379875868558884,
    0.11826305836439133,
    -0.03025442734360695,
    -0.021741541102528572,
    -0.11201265454292297,
    -0.002537490101531148,
    0.05298322066664696,
    -0.028340980410575867,
    0.06106146052479744,
    0.008077803067862988,
    0.17663083970546722,
    -0.003685560543090105,
    0.10226781666278839,
    -0.02625715732574463,
    0.07048310339450836,
    -0.0041020335629582405,
    0.06205780804157257,
    0.014489393681287766,
    0.18917924165725708,
    -0.14167338609695435,
    0.07672175019979477,
    0.07226265966892242,
    -0.045730654150247574,
    -0.02329341322183609,
    -0.033340565860271454,
    0.0750269964337349,
    0.007625228259712458,
    -0.014741001650691032,
    0.047066692262887955,
    0.03569594398140907,
    -0.024170901626348495,
    0.02716345340013504,
    -0.017437737435102463,
    0.08258355408906937,
    0.056423090398311615,
    -0.12129926681518555,
    -0.07505494356155396,
    -0.007080332841724157,
    -0.08031398802995682,
    0.031969331204891205,
    -0.0065279677510261536,
    0.03297021985054016,
    0.08616432547569275,
    0.021339990198612213,
    0.03018481470644474,
    0.02496941015124321,
    0.010120418854057789,
    0.02439231239259243,
    0.06975015252828598,
    -0.06710841506719589,
    -0.02949412912130356,
    0.10633236914873123,
    0.11825001239776611,
    -0.18725010752677917,
    0.1483727991580963,
    -0.022584127262234688,
    0.06588192284107208,
    -0.021272988989949226,
    -0.05772215873003006,
    0.10289015620946884,
    0.061958733946084976,
    0.09492912143468857,
    0.0378592349588871,
    0.016496118158102036,
    -0.039718110114336014,
    -0.008289751596748829,
    -0.06196874380111694,
    -0.014992229640483856,
    0.027386454865336418,
    0.10793406516313553,
    0.1283203512430191,
    0.1801082193851471,
    -0.07740885764360428,
    0.06873895227909088,
    0.06418176740407944,
    -0.06931738555431366,
    -0.12406701594591141,
    0.061649221926927567,
    0.05681632459163666,
    0.04401473328471184,
    0.012133409269154072,
    0.014345266856253147,
    0.0963335856795311
   ],
   [
    -0.12424732744693756,
    0.061764806509017944,
    0.07998687773942947,
    -0.05807334557175636,
    -0.14514844119548798,
    -0.05289861932396889,
    0.05308128148317337,
    0.020655112341046333,
    -0.02302488312125206,
    -0.03442934900522232,
    -0.14833229780197144,
    0.06274701654911041,
    -0.029942911118268967,
    -0.07580755650997162,
    0.12164143472909927,
    -0.19637297093868256,
    -0.0757763609290123,
    -0.02719123102724552,
    -0.0622711218893528,
    0.03868314251303673,
    -0.09378710389137268,
    -0.17170365154743195,
    -0.030273444950580597,
    0.10172902792692184,
    -0.058006979525089264,
    -0.05098037049174309,
    -0.01907694712281227,
    -0.001267692307010293,
    -0.1743786782026291,
    0.06728150695562363,
    0.10952719300985336,
    -0.08270502835512161,
    0.031944599002599716,
    0.016622789204120636,
    -4.623683344107121e-05,
    -0.2813695967197418,
    -0.02814745530486107,
    0.02377690188586712,
    0.037045981734991074,
    -0.2566806375980377,
    -0.15720532834529877,
    -0.15230390429496765,
    0.017474012449383736,
    -0.0009679569047875702,
    -0.017243390902876854,
    -0.08054318279027939,
    -0.07467097789049149,
    -0.14698763191699982,
    -0.0010312439408153296,
    -0.003513140371069312,
    -0.10474731028079987,
    -0.05184156447649002,
    -0.06379489600658417,
    -0.004211378283798695,
    -0.03932582214474678,
    0.008570448495447636,
    -0.014974676072597504,
    0.13026612997055054,
    -0.06722040474414825,
    0.04611070826649666,
    0.04601280018687248,
    -0.01418463047593832,
    0.09350480884313583,
    0.016998305916786194,
    0.11948338896036148,
    0.1506355255842209,
    -0.09552619606256485,
    -0.048037782311439514,
    0.02424246072769165,
    0.0452578142285347,
    0.07748265564441681,
    0.03533417731523514,
    0.03724252060055733,
    -0.010112667456269264,
    0.01646573655307293,
    -0.04222507029771805,
    -0.016186732798814774,
    0.11049263924360275,
    0.06970882415771484,
    -0.0416109524667263,
    -0.04735758900642395,
    -0.1959451586008072,
    0.0970519408583641,
    0.05516636744141579,
    0.04395575076341629,
    0.1549544334411621,
    0.03704993799328804,
    -0.04320069029927254,
    0.010923829860985279,
    0.21221421658992767,
    0.030004825443029404,
    0.04258063808083534,
    0.11564867943525314,
    0.022114083170890808,
    0.1020679622888565,
    0.011395041830837727,
    -0.03413684293627739,
    -0.04432292655110359,
    0.00864378921687603,
    -0.02545115165412426,
    0.01293872855603695,
    -0.024218475446105003,
    -0.14025749266147614,
