{
 "backend": "tensorflow",
 "class_name": "Sequential",
 "config": {
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      30,
      1
     ],
     "dtype": "float32",
     "name": "lstm_input",
     "ragged": false,
     "sparse": false
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "batch_input_shape": [
      null,
      30,
      1
     ],
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_1",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_1",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_2",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": true,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_2",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "LSTM",
    "config": {
     "activation": "tanh",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dropout": 0.0,
     "dtype": "float32",
     "go_backwards": false,
     "implementation": 2,
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "lstm_3",
     "recurrent_activation": "sigmoid",
     "recurrent_constraint": null,
     "recurrent_dropout": 0.0,
     "recurrent_initializer": {
      "class_name": "Orthogonal",
      "config": {
       "gain": 1.0,
       "seed": null
      }
     },
     "recurrent_regularizer": null,
     "return_sequences": false,
     "return_state": false,
     "stateful": false,
     "time_major": false,
     "trainable": true,
     "unit_forget_bias": true,
     "units": 50,
     "unroll": false,
     "use_bias": true
    }
   },
   {
    "class_name": "Dropout",
    "config": {
     "dtype": "float32",
     "name": "dropout_3",
     "noise_shape": null,
     "rate": 0.2,
     "seed": null,
     "trainable": true
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "activation": "linear",
     "activity_regularizer": null,
     "bias_constraint": null,
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "bias_regularizer": null,
     "dtype": "float32",
     "kernel_constraint": null,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "kernel_regularizer": null,
     "name": "dense",
     "trainable": true,
     "units": 1,
     "use_bias": true
    }
   }
  ],
  "name": "sequential"
 },
 "keras_version": "2.12.0",
 "weights": [
  [
   [
    -0.031590867787599564,
    -0.13517224788665771,
    -0.1274498701095581,
    -0.007036104798316956,
    -0.10831402987241745,
    -0.023518765345215797,
    0.20095790922641754,
    0.25954586267471313,
    -0.07316964864730835,
    -0.15365272760391235,
    0.007493137381970882,
    0.11857382208108902,
    -0.08530304580926895,
    -0.018689662218093872,
    0.1958324909210205,
    0.16848424077033997,
    0.06942319869995117,
    -0.043886274099349976,
    0.12220752984285355,
    0.17793603241443634,
    0.059801410883665085,
    0.16748882830142975,
    0.10806982219219208,
    0.013556702062487602,
    -0.11064852029085159,
    -0.03521805629134178,
    -0.049370698630809784,
    0.06801428645849228,
    -0.19134987890720367,
    -0.007757322397083044,
    -0.1332281529903412,
    0.06611382961273193,
    -0.18632827699184418,
    0.034601423889398575,
    -0.10369233042001724,
    0.14448341727256775,
    -0.1402779370546341,
    -0.20395861566066742,
    0.0830894410610199,
    0.15831921994686127,
    0.19721341133117676,
    -0.19593526422977448,
    0.1319981962442398,
    0.08111309260129929,
    -0.06433107703924179,
    -0.19987745583057404,
    0.09391768276691437,
    -0.06461754441261292,
    0.10716920346021652,
    -0.003474202938377857,
    0.090042844414711,
    0.11564172059297562,
    -0.21265026926994324,
    0.1836298406124115,
    -0.058924127370119095,
    -0.05748651549220085,
    -0.0801813006401062,
    0.11052001267671585,
    -0.12516410648822784,
    -0.09649752080440521,
    0.02387501485645771,
    0.03947903960943222,
    -0.044568680226802826,
    0.08718997985124588,
    -0.08163214474916458,
    0.17333267629146576,
    0.04039427638053894,
    -0.14346866309642792,
    0.003631051629781723,
    0.11827825009822845,
    0.1267506182193756,
    -0.08186304569244385,
    -0.03951086848974228,
    0.10779973119497299,
    0.044484131038188934,
    0.13246385753154755,
    -0.1280781328678131,
    -0.1451500952243805,
    -0.09010861814022064,
    -0.11275244504213333,
    -0.041718944907188416,
    -0.1341550499200821,
    -0.1543317437171936,
    0.0756671205163002,
    0.08892077952623367,
    -0.08179790526628494,
    0.05422038957476616,
    0.10570408403873444,
    -0.01405230350792408,
    0.16229349374771118,
    -0.10253473371267319,
    -0.0063317990861833096,
    -0.005530765280127525,
    0.034077227115631104,
    0.11951607465744019,
    -0.1597953736782074,
    -0.1634034514427185,
    0.07019758224487305,
    0.08723273873329163,
    0.11174041032791138,
    0.19760249555110931,
    -0.17993570864200592,
    0.1519429087638855,
    -0.15073923766613007,
    -0.19051146507263184,
    -0.04869300499558449,
    -0.15628540515899658,
    0.19079932570457458,
    -0.09754598140716553,
    -0.11154971271753311,
    0.1662874072790146,
    0.04885786399245262,
    0.14215877652168274,
    0.22253210842609406,
    -0.1792985051870346,
    -0.1475050300359726,
    0.07580545544624329,
    0.16893212497234344,
    -0.09588377922773361,
    0.07697170227766037,
    -0.17664988338947296,
    -0.12650786340236664,
    0.2828340530395508,
    0.15914571285247803,
    0.14215825498104095,
    -0.23517286777496338,
    -0.19504913687705994,
    0.15435625612735748,
    -0.078593909740448,
    -0.020547762513160706,
    0.16599597036838531,
    -0.1301420032978058,
    -0.09055547416210175,
    0.1631273478269577,
    -0.047636792063713074,
    0.12269168347120285,
    -0.19180263578891754,
    0.10641990602016449,
    -0.17863382399082184,
    0.16804717481136322,
    0.17677199840545654,
    0.0501161552965641,
    0.14441142976284027,
    0.0654863715171814,
    0.22313879430294037,
    0.1952040046453476,
    0.16555096209049225,
    0.0932064950466156,
    0.15447518229484558,
    -0.03138354420661926,
    0.030351685360074043,
    0.13271228969097137,
    -0.35867583751678467,
    0.14539261162281036,
    -0.14134685695171356,
    -0.21146531403064728,
    0.25865015387535095,
    0.14428770542144775,
    -0.05934322252869606,
    -0.15917548537254333,
    0.14607588946819305,
    0.06163179501891136,
    -0.010393866337835789,
    0.020564541220664978,
    0.2023942917585373,
    0.0693533793091774,
    -0.05820448696613312,
    -0.06014078110456467,
    -0.09450313448905945,
    -0.020841531455516815,
    0.20629239082336426,
    0.2341662347316742,
    0.21980561316013336,
    0.028274472802877426,
    0.029872680082917213,
    0.07899274677038193,
    -0.0025871407706290483,
    -0.07555393129587173,
    -0.23259848356246948,
    -0.02330837771296501,
    -0.16772231459617615,
    0.12489596754312515,
    -0.2507378160953522,
    0.12773291766643524,
    -0.1184353232383728,
    -0.08068238943815231,
    0.03839464485645294,
    -0.18814732134342194,
    0.0023942976258695126,
    -0.02354305610060692,
    0.1633397787809372,
    -0.223122701048851,
    0.15584294497966766,
    -0.08991577476263046,
    0.08917675912380219,
    -0.11998287588357925,
    -0.1535133570432663,
    -0.045499950647354126,
    0.19355611503124237,
    -0.05860321968793869
   ]
  ],
  [
   [
    -0.06861164420843124,
    0.04326768219470978,
    -0.06939957290887833,
    0.06291674822568893,
    0.10316065698862076,
    0.01400673482567072,
    0.1295301467180252,
    0.06980551034212112,
    0.02004306949675083,
    -0.15617404878139496,
    -0.08697345107793808,
    0.11454645544290543,
    0.00027199499891139567,
    -0.05058307945728302,
    0.3276158571243286,
    -0.09731770306825638,
    0.03894214704632759,
    0.042412590235471725,
    0.028929268941283226,
    0.00783891323953867,
    -0.01062876358628273,
    0.03665800392627716,
    0.21126367151737213,
    -0.019477955996990204,
    -0.07633984833955765,
    -0.0020812894217669964,
    -0.022210106253623962,
    0.012796236202120781,
    0.11012818664312363,
    -0.0763770267367363,
    -0.038030143827199936,
    -0.07184562087059021,
    0.09454981237649918,
    -0.0026959339156746864,
    -0.11804866045713425,
    -0.05870915204286575,
    -0.011987538076937199,
    -0.1290741115808487,
    0.0742114782333374,
    0.07394575327634811,
    0.15729817748069763,
    0.02584162726998329,
    0.10956694185733795,
    -0.10907122492790222,
    0.003166668349877,
    0.00028589172870852053,
    -0.06153472140431404,
    -0.03964381292462349,
    0.1431097835302353,
    0.11144595593214035,
    -0.01715039275586605,
    0.002596027683466673,
    0.04287438094615936,
    0.022426027804613113,
    -0.05902998521924019,
    -0.06344478577375412,
    0.05466048792004585,
    -0.07511799037456512,
    0.008895362727344036,
    -0.08111672848463058,
    -0.11903257668018341,
    -0.047939483076334,
    0.07077844440937042,
    -0.061271652579307556,
    0.02371564880013466,
    -0.010959896259009838,
    0.015012877993285656,
    0.028376638889312744,
    -0.04785514250397682,
    -0.08757124841213226,
    0.08317028731107712,
    -0.15892042219638824,
    -0.035270266234874725,
    0.09674180299043655,
    0.023146366700530052,
    0.07223129272460938,
    0.03982897475361824,
    -0.044247377663850784,
    0.029934361577033997,
    -0.12020376324653625,
    -0.010952794924378395,
    -0.020522359758615494,
    -0.06037380173802376,
    -0.03214872628450394,
    0.05438018590211868,
    -0.01866787299513817,
    -0.08120427280664444,
    0.0378674641251564,
    0.13858570158481598,
    0.09692813456058502,
    -0.07899481803178787,
    0.0005078617250546813,
    -0.007249195594340563,
    0.03170015290379524,
    -0.04818112403154373,
    0.1514253169298172,
    0.07018895447254181,
    -0.014148896560072899,
    -0.02792012132704258,
    -0.04978324472904205,
    -0.11625544726848602,
    -0.016010131686925888,
    0.03592618182301521,
    0.07286832481622696,
    -0.003557119518518448,
    0.08458910137414932,
    0.11643008887767792,
    -0.1660802811384201,
    -0.0588361918926239,
    -0.01618918776512146,
    -0.06678532809019089,
    0.06177951395511627,
    -0.09997140616178513,
    -0.14571517705917358,
    0.10846257954835892,
    -0.025794893503189087,
    0.0639229267835617,
    -0.09248996526002884,
    0.028121531009674072,
    -0.10786189883947372,
    0.08934279531240463,
    0.01460652332752943,
    -0.08415506780147552,
    0.05511057749390602,
    -0.04207208380103111,
    -0.04816706106066704,
    0.0012266988633200526,
    0.10402701795101166,
    -0.04282887279987335,
    -0.042472075670957565,
    -0.017946016043424606,
    0.07021769881248474,
    -0.042617615312337875,
    -0.036300648003816605,
    -0.08597847074270248,
    0.08196698874235153,
    -0.009320824407041073,
    -0.07635937631130219,
    -0.04718231409788132,
    -0.1116502583026886,
    0.03352275490760803,
    0.18165665864944458,
    -0.08256477117538452,
    0.032887913286685944,
    -0.07410531491041183,
    0.08494780212640762,
    -0.15677767992019653,
    0.0500226765871048,
    -0.05560782924294472,
    0.03377348184585571,
    0.054719194769859314,
    0.07784174382686615,
    0.027993613854050636,
    0.06371085345745087,
    0.0670003890991211,
    -0.01154033187776804,
    -0.027105577290058136,
    0.12660585343837738,
    0.08615243434906006,
    0.058056220412254333,
    0.07940997928380966,
    0.027573196217417717,
    0.018204355612397194,
    -0.06945721060037613,
    0.17219310998916626,
    0.11124075949192047,
    -0.04014764353632927,
    0.045405272394418716,
    -0.017163237556815147,
    -0.034968871623277664,
    0.06970595568418503,
    0.0491495206952095,
    0.03899523988366127,
    -0.14933991432189941,
    -0.06700040400028229,
    -0.06749318540096283,
    0.1261821985244751,
    -0.03760036826133728,
    -0.059945713728666306,
    -0.22237169742584229,
    -0.09780266135931015,
    -0.01970454305410385,
    -0.029677975922822952,
    0.037390608340501785,
    -0.07088267058134079,
    -0.02017230913043022,
    -0.1100316122174263,
    -0.18583407998085022,
    -0.01092707458883524,
    -0.0761660784482956,
    -0.0511922650039196,
    0.03667820990085602,
    0.10075746476650238,
    0.051918163895606995,
    0.06985644996166229,
    -0.15943408012390137,
    0.01456508506089449,
    -0.10245180130004883,
    -0.04437772557139397,
    -0.009919876232743263
   ],
   [
    0.10632918030023575,
    -0.11398225277662277,
    -0.07360699772834778,
    -0.03337808698415756,
    0.013494361191987991,
    0.04830482229590416,
    -0.12274901568889618,
    -0.11506648361682892,
    -0.05905558913946152,
    -0.05845029652118683,
    -0.009954730980098248,
    0.03238386660814285,
    0.08210756629705429,
    0.0016167738940566778,
    -0.010593355633318424,
    -0.05821963772177696,
    -0.030008655041456223,
    -0.06670107692480087,
    -0.06423342227935791,
    0.010919406078755856,
    -0.021080657839775085,
    0.1016964390873909,
    -0.14577078819274902,
    0.014829540625214577,
    -0.031003382056951523,
    -0.008419521152973175,
    0.10678667575120926,
    0.013846641406416893,
    -0.08503776788711548,
    -0.22298663854599,
    0.100229911506176,
    0.02683326043188572,
    -0.01131180115044117,
    0.044542405754327774,
    0.003620380302891135,
    0.04282109811902046,
    0.04048539325594902,
    0.00694154342636466,
    0.07715355604887009,
    0.0020595716778188944,
    -0.05148480832576752,
    0.13885526359081268,
    -0.007090935483574867,
    -0.011027948930859566,
    -0.05333509296178818,
    -0.09915782511234283,
    -0.07415436208248138,
    0.015899864956736565,
    -0.09319739788770676,
    0.0017413485329598188,
    0.07699726521968842,
    0.1898980438709259,
    0.0665321946144104,
    0.10596396774053574,
    0.1300588697195053,
    0.11065524071455002,
    0.09280109405517578,
    -0.025901243090629578,
    0.0851203054189682,
    -0.09032733738422394,
    7.792779797455296e-05,
    0.023066092282533646,
    0.022668369114398956,
    0.07546790689229965,
    0.08462314307689667,
    0.060386866331100464,
    -0.024720165878534317,
    0.06545761227607727,
    0.07827285677194595,
    -0.029766427353024483,
    -0.060716673731803894,
    -0.019297292456030846,
    0.07752492278814316,
    0.05689575895667076,
    -0.028610071167349815,
    -0.03934222087264061,
    -0.005650392267853022,
    -0.04335062578320503,
    -0.059040747582912445,
    0.19633707404136658,
    -0.03503789007663727,
    -0.04410868510603905,
    -0.08328655362129211,
    -0.038938988000154495,
    0.026546534150838852,
    0.026075510308146477,
    0.06486661732196808,
    -0.09339982271194458,
    0.06339559704065323,
    -0.006196756847202778,
    0.03152170404791832,
    0.061118777841329575,
    -0.08997508138418198,
    0.08149974793195724,
    0.11948371678590775,
    0.003946465440094471,
    0.13118818402290344,
    0.0033664796501398087,
    -0.057439547032117844,
    -0.005269434303045273,
    0.06398747116327286,
    -0.18489420413970947,
    -0.0005880501121282578,
    -0.049657855182886124,
    0.0013786819763481617,
    -0.12766732275485992,
    0.0025666768196970224,
    -0.026914207264780998,
    -0.00934543926268816,
    -0.10971672087907791,
    -0.02248062752187252,
    0.08122161775827408,
    0.1315293312072754,
    0.030963731929659843,
    -0.12801778316497803,
    -0.02373446151614189,
    0.15095293521881104,
    0.15093836188316345,
    -0.15174110233783722,
    0.12343700230121613,
    -0.10455061495304108,
    -0.1608029454946518,
    0.14002272486686707,
    0.0579369030892849,
    0.05049421265721321,
    0.10055414587259293,
    -0.07449207454919815,
    -0.02690071612596512,
    -0.08233385533094406,
    0.009580805897712708,
    0.046897705644369125,
    0.03462029621005058,
    -0.147367924451828,
    0.08681032061576843,
    0.06731536984443665,
    0.10017460584640503,
    -0.15401768684387207,
    -0.07471875101327896,
    -0.1356627345085144,
    0.049665261059999466,
    -0.07498076558113098,
    -0.03842915967106819,
    -0.053429003804922104,
    -0.057387083768844604,
    0.10596899688243866,
    0.11676855385303497,
    -0.005580483935773373,
    0.07128262519836426,
    0.045624248683452606,
    -0.015558100305497646,
    -0.06228302791714668,
    0.000998525065369904,
    0.09391593933105469,
    -0.12717773020267487,
    -0.06661596894264221,
    -0.07351936399936676,
    -0.08607861399650574,
    -0.09675149619579315,
    -0.138419970870018,
    -0.05126344412565231,
    0.031534552574157715,
    -0.023464370518922806,
    0.048514630645513535,
    -0.08275622129440308,
    -0.06785432249307632,
    -0.10656533390283585,
    -0.0993889719247818,
    0.016498185694217682,
    -0.004606120754033327,
    0.046259477734565735,
    -0.11957047134637833,
    -0.09549460560083389,
    -0.11214915663003922,
    0.031031444668769836,
    -0.15686476230621338,
    -0.08721067756414413,
    -0.00831479113548994,
    0.04192496836185455,
    -0.043681781738996506,
    0.10993896424770355,
    0.045401088893413544,
    0.11559727787971497,
    0.06460486352443695,
    -0.04259832575917244,
    0.07706749439239502,
    0.09316333383321762,
    -0.012819378636777401,
    0.06503704190254211,
    0.0037021988537162542,
    -0.005419870372861624,
    0.0288846418261528,
    0.028734972700476646,
    -0.05154271423816681,
    0.05622779205441475,
    0.026602335274219513,
    0.028670959174633026,
    -0.10095570981502533,
    0.03637249767780304,
    0.0663013905286789,
    0.07768968492746353
   ],
   [
    -0.049664583057165146,
    -0.030832748860120773,
    -0.07911301404237747,
    -0.06186707690358162,
    -0.4103630781173706,
    0.0057958210818469524,
    -0.17324604094028473,
    0.010437939316034317,
    -0.15700845420360565,
    -0.041372258216142654,
    -0.15206675231456757,
    0.022531429305672646,
    -0.16017815470695496,
    -0.35231807827949524,
    -0.507247269153595,
    0.06409893929958344,
    0.021268382668495178,
    -0.15673406422138214,
    0.06314508616924286,
    0.001612924737855792,
    -0.19267922639846802,
    -0.164195254445076,
    -0.7057206630706787,
    -0.1280585378408432,
    -0.10465424507856369,
    -0.012830953113734722,
    -0.2490338683128357,
    -0.1808338612318039,
    -0.018964119255542755,
    0.012384720146656036,
    -0.25576362013816833,
    -0.17725440859794617,
    -0.002558329841122031,
    -0.021148625761270523,
    0.020214827731251717,
    -0.10091540962457657,
    -0.39380908012390137,
    0.13864672183990479,
    0.1154126226902008,
    -0.06371145695447922,
    0.04533403739333153,
    -0.06360582262277603,
    -0.03131958469748497,
    0.06366904079914093,
    -0.15101003646850586,
    -0.05686795711517334,
    -0.19112630188465118,
    -0.10275495052337646,
    -0.34711822867393494,
    -0.03212732821702957,
    0.026089491322636604,
    0.08160997182130814,
    0.020854702219367027,
    -0.008225561119616032,
    0.0727667510509491,
    0.051541153341531754,
    -0.022176925092935562,
    0.03234462812542915,
    -0.07780396938323975,
    -0.06489035487174988,
    0.007594528142362833,
    0.06835617125034332,
    0.02308417484164238,
    0.06527912616729736,
    -0.06450317054986954,
    0.041790250688791275,
    -0.09863515943288803,
    0.029758883640170097,
    0.11160996556282043,
    0.054600685834884644,
    0.03369925543665886,
    0.10601509362459183,
    0.055745139718055725,
    -0.054303113371133804,
    -0.10350967943668365,
    -0.16310717165470123,
    0.07877744734287262,
    0.12621550261974335,
    0.18229790031909943,
    -0.09300962835550308,
    0.11979223787784576,
    -0.01306447759270668,
    0.024698810651898384,
    -0.06761378049850464,
    -0.03528868034482002,
    0.12014249712228775,
    0.010787371546030045,
    0.010121229104697704,
    0.20547446608543396,
    0.029807908460497856,
    0.025380171835422516,
    0.029034942388534546,
    0.159687802195549,
    0.024753885343670845,
    -0.028119273483753204,
    0.13289467990398407,
    0.15147197246551514,
    0.05789051949977875,
    0.035948239266872406,
    -0.10724363476037979,
    -0.03267039358615875,
    0.03706337511539459,
    -0.20948909223079681,
    0.0763639360666275,
    0.1326797753572464,
    0.08543501794338226,
    -0.002064068801701069,
    0.0025915608275681734,
    0.05093860253691673,
    0.0849040150642395,
    -0.10606610774993896,
    0.26180633902549744,
    -0.11692564934492111,
    0.07273923605680466,
    0.1707698553800583,
    -0.01965557597577572,
    0.3954298496246338,
    0.0649435818195343,
    -0.07176297903060913,
    0.12452933192253113,
    0.13246896862983704,
    0.07039280235767365,
    0.2290695309638977,
    0.15128974616527557,
    -0.019388578832149506,
    -0.20612938702106476,
    -0.026865271851420403,
    -0.009154385887086391,
    -0.029650576412677765,
    -0.12524503469467163,
    -0.03271741420030594,
    0.050908412784338,
    0.06698540598154068,
    -0.026059333235025406,
    -0.13631990551948547,
    -0.09337541460990906,
    -0.05316385626792908,
    -0.20054201781749725,
    0.043890517204999924,
    0.0793057456612587,
    0.12010842561721802,
    0.11459315568208694,
    0.07605978101491928,
    0.09773383289575577,
    0.0869961529970169,
    0.08500050008296967,
    -0.10759581625461578,
    0.1251760572195053,
    -0.03501955419778824,
    -0.017958255484700203,
    -0.11574416607618332,
    -0.11719194799661636,
    -0.2722570598125458,
    -0.05834876373410225,
    -0.2249208390712738,
    0.0520610474050045,
    -0.06552837789058685,
    -0.0939563736319542,
    -0.12814658880233765,
    -0.09270969033241272,
    -0.2789994180202484,
    0.2513282001018524,
    -0.18918882310390472,
    -0.11884503811597824,
    -0.7081953883171082,
    -0.0053182062692940235,
    0.06955841928720474,
    -0.12505342066287994,
    0.0012890412472188473,
    -0.002476232126355171,
    -0.17233064770698547,
    -0.12699688971042633,
    -0.7074202299118042,
    -0.000731131003703922,
    -0.18464110791683197,
    -0.026888951659202576,
    -0.3903002142906189,
    -0.04850798100233078,
    -0.07668190449476242,
    -0.20286861062049866,
    -0.26256123185157776,
    -0.07871458679437637,
    0.11874988675117493,
    -0.12368437647819519,
    -0.0905739963054657,
    -0.04588467255234718,
    -0.34470880031585693,
    0.013804520480334759,
    0.1030036136507988,
    -0.14254309237003326,
    0.01419396884739399,
    -0.04805966839194298,
    -0.006513611879199743,
    -0.12297982722520828,
    -0.20127135515213013,
    -0.046918775886297226,
    -0.3237004280090332,
    0.029455607756972313,
    -0.29655972123146057,
    -0.005239367485046387
   ],
   [
    -0.030139420181512833,
    -0.01387560274451971,
    0.02776523493230343,
    -0.00219993875361979,
    -0.10678842663764954,
    0.06284692883491516,
    -0.031031832098960876,
    0.006540572736412287,
    -0.11360354721546173,
    -0.018224315717816353,
    -0.09018316119909286,
    0.12111769616603851,
    0.05109120160341263,
    0.0384196899831295,
    -0.15116144716739655,
    -0.04349280521273613,
    -0.09722381830215454,
    0.04130924865603447,
    -0.01775742694735527,
    0.02429608628153801,
    0.016001923009753227,
    0.005337424576282501,
    -0.13780289888381958,
    0.0410112664103508,
    -0.14399532973766327,
    -0.03945447877049446,
    -0.11540478467941284,
    -0.1416693478822708,
    0.05369256064295769,
    0.04856277257204056,
    -0.010263335891067982,
    -0.08537089079618454,
    -0.09464448690414429,
    0.0419313870370388,
    -0.0011426873970776796,
    0.04971645399928093,
    -0.18626746535301208,
    0.07157006859779358,
    0.07731102406978607,
    0.0729006677865982,
    -0.09622986614704132,
    0.003118769498541951,
    -0.13318319618701935,
    0.04295651614665985,
    -0.05428214371204376,
    -0.03452890366315842,
    -0.04695605859160423,
    0.1035209447145462,
    -0.16175208985805511,
    -0.09997830539941788,
    0.06800749152898788,
    0.062222886830568314,
    0.055336035788059235,
    -0.0023815769236534834,
    -0.10443324595689774,
    0.12259892374277115,
    -0.026213038712739944,
    -0.05758759379386902,
    -0.1080435961484909,
    0.05862711742520332,
    -0.07463380694389343,
    0.07305427640676498,
    0.0001899875933304429,
    0.09611421078443527,
    0.09967735409736633,
    -0.01656123250722885,
    -0.04260120913386345,
    -0.05953628197312355,
    0.042017389088869095,
    0.16562767326831818,
    0.049744367599487305,
    0.019937140867114067,
    0.03829748183488846,
    -0.02749229222536087,
    0.06307714432477951,
    -0.08105449378490448,
    0.0282468032091856,
    -0.0842549130320549,
    -0.015252542681992054,
    0.04586458206176758,
    0.0031801960431039333,
    0.03634050861001015,
    -0.04896007105708122,
    -0.013082698918879032,
    -0.00850194413214922,
    0.03737201914191246,
    0.12805064022541046,
    -0.09339071810245514,
    -0.04412247613072395,
    0.011521006934344769,
    -0.07810560613870621,
    -0.033271998167037964,
    0.18562886118888855,
    0.013769486919045448,
    -0.0008071814081631601,
    -0.020111290737986565,
    0.05592331662774086,
    -0.01318416092544794,
    -0.13966020941734314,
    0.17349112033843994,
    -0.04779757931828499,
    0.03923214599490166,
    0.00747159356251359,
    -0.08058153837919235,
    -0.0022156855557113886,
    -0.04918615147471428,
    -0.031866688281297684,
    0.05014840513467789,
    0.061429716646671295,
    0.11136805266141891,
    -0.01049898099154234,
    -0.12317294627428055,
    -0.0004560390370897949,
    0.08308801054954529,
    -0.019056197255849838,
    -0.015041889622807503,
    -0.07777562737464905,
    -0.059214696288108826,
    0.00023381540086120367,
    0.057917218655347824,
    -0.06649264693260193,
    -0.0018114817794412374,
    0.02317889593541622,
    -0.08009962737560272,
    0.05311909690499306,
    0.1418565809726715,
    -0.03303799778223038,
    0.1786075383424759,
    0.0809369757771492,
    0.09412730485200882,
    0.12631413340568542,
    0.04864547774195671,
    0.033917490392923355,
    0.0240167323499918,
    0.0963059738278389,
    -0.0036964365281164646,
    -0.030733412131667137,
    0.06168334186077118,
    0.05066690966486931,
    0.054108791053295135,
    -0.08031373471021652,
    0.034275613725185394,
    0.09284646809101105,
    0.09450563043355942,
    0.18206427991390228,
    -0.039432741701602936,
    0.030457008630037308,
    -0.009474914520978928,
    -0.031028959900140762,
    0.03676724433898926,
    0.10786224901676178,
    0.06584039330482483,
    0.0031629742588847876,
    -0.0635657012462616,
    -0.14465859532356262,
    -0.0011578244157135487,
    0.020040705800056458,
    -0.1188746988773346,
    -0.04848124086856842,
    -0.12515322864055634,
    0.06973333656787872,
    -0.009802326560020447,
    0.04532956704497337,
    -0.18696404993534088,
    -0.07157731801271439,
    -0.15047676861286163,
    -0.0579688623547554,
    0.08205078542232513,
    -0.1717655211687088,
    0.04009401425719261,
    -0.07421565800905228,
    -0.21051642298698425,
    -0.18467232584953308,
    -0.09114694595336914,
    0.10572242736816406,
    0.07954062521457672,
    -0.12581747770309448,
    0.0411064475774765,
    0.05562983825802803,
    0.10459191352128983,
    0.014530779793858528,
    -0.0012190865818411112,
    0.02613581344485283,
    0.10688687115907669,
    0.06433805078268051,
    -0.05836477130651474,
    -0.11272682249546051,
    -0.14235956966876984,
    0.08451607823371887,
    -0.11085783690214157,
    -0.09816534072160721,
    -0.017387308180332184,
    0.02288409322500229,
    -0.07327597588300705,
    -0.027559755370020866,
    0.011396271176636219,
    -0.14791548252105713,
    0.020465869456529617,
    -0.06894036382436752,
    0.027824642136693
   ],
   [
    0.005146046634763479,
    0.23541513085365295,
    0.36100050806999207,
    0.049536462873220444,
    0.3044935464859009,
    -0.040022753179073334,
    0.3017214238643646,
    -0.08215472102165222,
    0.3136526048183441,
    -0.07133722305297852,
    0.12232190370559692,
    -0.19074894487857819,
    0.06171301007270813,
    0.15713077783584595,
    0.1555512696504593,
    0.10100696235895157,
    -0.21265989542007446,
    0.13771314918994904,
    0.035816166549921036,
    -0.05307767912745476,
    0.09272497892379761,
    0.04281781613826752,
    0.5180553197860718,
    -0.03578195348381996,
    -0.0030856598168611526,
    -0.2221727818250656,
    0.2304636836051941,
    0.023555688560009003,
    0.008770355023443699,
    0.06959456950426102,
    0.1692006140947342,
    -0.009727828204631805,
    0.027627697214484215,
    -0.12271397560834885,
    -0.029505213722586632,
    0.04452471062541008,
    0.20261098444461823,
    0.22689184546470642,
    0.11614091694355011,
    0.0025078458711504936,
    -0.04130924865603447,
    -0.04609023407101631,
    -0.12117459625005722,
    -0.10511013865470886,
    -0.051192883402109146,
    0.040600504726171494,
    0.22096577286720276,
    0.11860779672861099,
    0.14043493568897247,
    -0.10390413552522659,
    -0.050598982721567154,
    -0.02612270787358284,
    -0.06734809279441833,
    -0.028594937175512314,
    -0.0036147162318229675,
    0.043215297162532806,
    0.11195849627256393,
    -0.10338567197322845,
    0.19249901175498962,
    0.12591440975666046,
    -0.03751552104949951,
    -0.22113099694252014,
    0.00041234702803194523,
    -0.03451453521847725,
    0.07759089767932892,
    0.05656523257493973,
    0.02314535155892372,
    0.02873281016945839,
    -0.04614006355404854,
    -0.05907794088125229,
    0.13618284463882446,
    0.03141622617840767,
    -0.2537069320678711,
    -0.030342882499098778,
    -0.008251753635704517,
    -0.2320978194475174,
    0.015907185152173042,
    -0.13102246820926666,
    0.051539041101932526,
    0.08277787268161774,
    -0.026594797149300575,
    -0.14507056772708893,
    0.05708996579051018,
    -0.04336027801036835,
    -0.005481287837028503,
    -0.050815921276807785,
    -0.07862294465303421,
    0.052184950560331345,
    -0.050139788538217545,
    -0.13306039571762085,
    -0.029935874044895172,
    0.04016163945198059,
    -0.009901170618832111,
    0.031216779723763466,
    0.07899907976388931,
    0.0008602298912592232,
    0.15142638981342316,
    0.05130332335829735,
    0.0583345890045166,
    0.005195974372327328,
    0.04607485234737396,
    0.048485517501831055,
    0.08258102089166641,
    -0.0922790914773941,
    -0.17886663973331451,
    0.034058794379234314,
    0.0012834509834647179,
    0.056657031178474426,
    0.011107493191957474,
    -0.05856315419077873,
    -0.002837526146322489,
    -0.1240471675992012,
    0.15376657247543335,
    -0.02352013811469078,
    -0.09718617051839828,
    0.06781713664531708,
    0.09507322311401367,
    0.10945268720388412,
    0.010617978870868683,
    -0.015403593890368938,
    -0.09230297803878784,
    0.06583347916603088,
    0.12804754078388214,
    -0.0949728712439537,
    -0.04791148006916046,
    0.2807914912700653,
    -0.05426735430955887,
    0.10508491098880768,
    0.0034581487998366356,
    0.16445866227149963,
    0.14255131781101227,
    -0.16930654644966125,
    0.13603200018405914,
    0.03889288753271103,
    0.22613708674907684,
    0.0011436232598498464,
    -0.11024583876132965,
    -0.12387029826641083,
    0.018027255311608315,
    -0.05495047941803932,
    -0.14475613832473755,
    -0.1080213338136673,
    -0.13181772828102112,
    -0.15457101166248322,
    0.01692940481007099,
    -0.1629430055618286,
    -0.04904591292142868,
    -0.021880965679883957,
    0.06956639885902405,
    0.032008130103349686,
    -0.011209942400455475,
    0.09102266281843185,
    0.4259309470653534,
    -0.014851631596684456,
    0.2983644902706146,
    -0.021969709545373917,
    0.05773475021123886,
    -0.08796650171279907,
    0.26258254051208496,
    -0.03748397156596184,
    0.15792158246040344,
    -0.3670348525047302,
    0.07327598333358765,
    0.13497984409332275,
    0.39775073528289795,
    -0.03824334219098091,
    -0.16373814642429352,
    0.07164501398801804,
    0.03740239143371582,
    0.07048250734806061,
    0.16231727600097656,
    -0.01606435328722,
    0.4081086218357086,
    -0.03172360733151436,
    0.03640802577137947,
    -0.16898973286151886,
    0.39027124643325806,
    0.11863508820533752,
    0.021422281861305237,
    -0.01243642158806324,
    0.2561244070529938,
    -0.2003088891506195,
    0.21591928601264954,
    -0.05135108903050423,
    0.18723896145820618,
    0.08485647290945053,
    0.37398895621299744,
    0.2647719979286194,
    0.031738266348838806,
    -0.0511084608733654,
    -0.19783353805541992,
    0.21157966554164886,
    -0.06526116281747818,
    -0.05433928221464157,
    -0.03471855819225311,
    0.07876695692539215,
    0.2598438262939453,
    0.0859355479478836,
    0.125221848487854,
    -0.08716589212417603
   ],
   [
    -0.058165837079286575,
    -0.027279643341898918,
    0.048117782920598984,
    0.10761440545320511,
    0.141840398311615,
    0.0076590110547840595,
    0.038209881633520126,
    -0.030206650495529175,
    0.10337365418672562,
    -0.06606117635965347,
    0.055383358150720596,
    -0.018962804228067398,
    -0.013173365965485573,
    0.15530860424041748,
    0.2119491547346115,
    0.04984913021326065,
    -0.0008814642787910998,
    0.01754654012620449,
    0.06247302144765854,
    -0.08057443797588348,
    0.0455164834856987,
    0.09066203981637955,
    0.38798364996910095,
    0.03231325000524521,
    0.07653063535690308,
    -0.0746103823184967,
    -0.006842494942247868,
    -0.11274273693561554,
    -0.02019002102315426,
    -0.12048278003931046,
    0.022820835933089256,
    -0.08443222939968109,
    -0.04477410018444061,
    0.023281076923012733,
    -0.13807937502861023,
    0.06407856196165085,
    0.16008010506629944,
    0.06788228452205658,
    -0.020655544474720955,
    -0.08035440742969513,
    -0.03832123428583145,
    0.07415972650051117,
    0.008459249511361122,
    0.01187439076602459,
    0.10658925026655197,
    -0.05539974942803383,
    -0.007775616832077503,
    -0.005199895706027746,
    0.1317598521709442,
    0.03307955712080002,
    0.03956642374396324,
    0.01979658007621765,
    -0.14233700931072235,
    0.05070504546165466,
    0.03138789162039757,
    0.0398605577647686,
    -0.16246028244495392,
    0.04426711052656174,
    -0.04410988837480545,
    -0.14652706682682037,
    -0.17053934931755066,
    -0.10417763143777847,
    0.11542367935180664,
    -0.16184020042419434,
    -0.062124103307724,
    0.014051004312932491,
    -0.08298446238040924,
    -0.05665253475308418,
    0.09407885372638702,
    -0.008461526595056057,
    -0.1233164444565773,
    0.035814691334962845,
    -0.13403253257274628,
    -0.0918419137597084,
    0.024870814755558968,
    -0.012159186415374279,
    -0.1045137494802475,
    -0.0060808295384049416,
    0.09387608617544174,
    0.008177533745765686,
    -0.1736970990896225,
    -0.06625879555940628,
    0.14224909245967865,
    -0.09191129356622696,
    0.07868817448616028,
    0.06341482698917389,
    -0.18788358569145203,
    0.08324471116065979,
    -0.027726972475647926,
    0.04159817844629288,
    -0.02429167553782463,
    -0.020002812147140503,
    -0.034677159041166306,
    -0.05797410383820534,
    -0.166900634765625,
    -0.043953970074653625,
    -0.05091479420661926,
    -0.016209499910473824,
    -0.004744091536849737,
    -0.027050619944930077,
    0.013195440173149109,
    0.08586764335632324,
    0.020252203568816185,
    -0.07870623469352722,
    0.03521471470594406,
    0.05289657786488533,
    0.2236103117465973,
    -0.0042245108634233475,
    0.1106584295630455,
    -0.09737324714660645,
    -0.1261812001466751,
    -0.01969681866466999,
    -0.07336273044347763,
    -0.16402465105056763,
    -0.022075915709137917,
    0.027559779584407806,
    -0.0957769975066185,
    -0.0785321518778801,
    0.035857927054166794,
    0.06818081438541412,
    0.048969946801662445,
    -0.018735261633992195,
    -0.032167356461286545,
    -0.09493570029735565,
    -0.016299281269311905,
    -0.09198326617479324,
    -0.01675901748239994,
    0.026398923248052597,
    0.08954302221536636,
    0.16933046281337738,
    0.039156846702098846,
    -0.0025422314647585154,
    0.03299974650144577,
    -0.15054985880851746,
    0.11616174876689911,
    -0.0049692257307469845,
    0.11205849051475525,
    -0.1164620891213417,
    0.15345361828804016,
    -0.040491703897714615,
    -0.03788575530052185,
    -0.14057020843029022,
    -0.1526288241147995,
    -0.04071006178855896,
    -0.16931754350662231,
    -0.10205820947885513,
    -0.12996956706047058,
    -0.2647504210472107,
    -0.09179608523845673,
    -0.035401325672864914,
    -0.033330038189888,
    -0.018702656030654907,
    0.16315872967243195,
    -0.007757155690342188,
    0.3100038468837738,
    0.13080927729606628,
    0.03337433189153671,
    -0.05050283670425415,
    0.05511315166950226,
    0.05444740504026413,
    -0.17416270077228546,
    -0.10615931451320648,
    0.05248972773551941,
    -0.08932683616876602,
    0.20338015258312225,
    0.08291849493980408,
    0.018663080409169197,
    0.026394499465823174,
    0.04352877661585808,
    -0.07993347197771072,
    -0.08860574662685394,
    0.05940010026097298,
    0.22908298671245575,
    -0.17001953721046448,
    0.021869400516152382,
    0.08220827579498291,
    0.01834188774228096,
    -0.04574570804834366,
    -0.09654103219509125,
    -0.14202797412872314,
    -0.08225734531879425,
    -0.03931211307644844,
    -0.07658208906650543,
    -0.044382814317941666,
    -0.12275698035955429,
    -0.031229088082909584,
    0.11023647338151932,
    0.07616948336362839,
    0.004000829067081213,
    0.005683013703674078,
    0.02790937013924122,
    0.12796466052532196,
    0.0895962193608284,
    -0.051425181329250336,
    0.06571732461452484,
    -0.028671441599726677,
    0.10269136726856232,
    0.0620049424469471,
    0.01940957084298134,
    -0.06262139976024628
   ],
   [
    -0.07098730653524399,
    0.04320097342133522,
    -0.20492881536483765,
    -0.004059506580233574,
    -0.3246223032474518,
    0.09964433312416077,
    0.023964280262589455,
    -0.13034577667713165,
    -0.08959778398275375,
    -0.14926740527153015,
    -0.1371314823627472,
    -0.028084179386496544,
    -0.0346052423119545,
    0.023317592218518257,
    -0.34977978467941284,
    0.07008188962936401,
    -0.053963787853717804,
    -0.010633648373186588,
    0.06750787049531937,
    -0.10585176944732666,
    -0.13251976668834686,
    -0.19026535749435425,
    -0.5199951529502869,
    0.07345303893089294,
    -0.18504180014133453,
    -0.12261683493852615,
    -0.06578605622053146,
    -0.14113564789295197,
    0.02622063457965851,
    0.15806150436401367,
    -0.1998249590396881,
    0.038294970989227295,
    0.09225846827030182,
    -0.01013000588864088,
    -0.014782745391130447,
    -0.17757897078990936,
    -0.3064941465854645,
    0.11425761133432388,
    -0.07262995839118958,
    0.10452810674905777,
    -0.049176882952451706,
    0.06190267577767372,
    -0.042221806943416595,
    -0.026232054457068443,
    -0.13482233881950378,
    0.09694535285234451,
    -0.0847213938832283,
    -0.06488839536905289,
    0.04038622975349426,
    -0.058146875351667404,
    -0.07464470714330673,
    0.0844433382153511,
    -0.056425876915454865,
    -0.049505870789289474,
    0.06495361775159836,
    0.07350623607635498,
    0.036206454038619995,
    -0.035457588732242584,
    0.008023646660149097,
    0.10818810015916824,
    0.00459715211763978,
    0.05814677104353905,
    -0.049926526844501495,
    -0.014472568407654762,
    0.08813446760177612,
    0.04086634889245033,
    -0.10054588317871094,
    0.13021716475486755,
    -0.0672471672296524,
    -0.10292905569076538,
    -0.06363832950592041,
    -0.08251156657934189,
    0.020587535575032234,
    0.08401518315076828,
    -0.014600156806409359,
    -0.1489299237728119,
    0.010090963914990425,
    0.1327064484357834,
    0.07820513099431992,
    0.059625208377838135,
    0.07209784537553787,
    0.06292196363210678,
    0.021203909069299698,
    -0.01875767856836319,
    0.1769939363002777,
    -0.09207543730735779,
    0.026297690346837044,
    0.13394296169281006,
    -0.08491459488868713,
    0.02270343527197838,
    0.05085357278585434,
    0.027214959263801575,
    -0.11443961411714554,
    -0.07063431292772293,
    0.0004280765715520829,
    0.03171204403042793,
    -0.03429170325398445,
    0.06130862608551979,
    -0.03579440712928772,
    0.07505062967538834,
    -0.09737373888492584,
    -0.09553541243076324,
    0.004138405900448561,
    0.036538880318403244,
    -0.05643567070364952,
    -0.04351465031504631,
    -0.14338460564613342,
    0.07783611118793488,
    0.06383002549409866,
    -0.036000754684209824,
    0.07213930785655975,
    0.0021623880602419376,
    -0.007024579681456089,
    -0.008428962901234627,
    -0.11457563191652298,
    0.04661019891500473,
    0.01001698337495327,
    -0.0256945863366127,
    -0.0576750673353672,
    0.046698883175849915,
    0.028101012110710144,
    -0.10923103988170624,
    0.0486290343105793,
    -0.05128467082977295,
    0.11433067172765732,
    0.15881331264972687,
    -0.03841937333345413,
    0.08483578264713287,
    -0.009509843774139881,
    -0.07729307562112808,
    0.009075839072465897,
    -0.14110355079174042,
    -0.027134021744132042,
    -0.03456321358680725,
    0.04981331527233124,
    -0.16084082424640656,
    -0.17115597426891327,
    -0.029191650450229645,
    -0.13080662488937378,
    0.058688901364803314,
    -0.05226738750934601,
    -0.0032998675014823675,
    -0.05438388139009476,
    -0.06620179116725922,
    0.036010369658470154,
    -0.015611390583217144,
    0.03302459418773651,
    0.03207332640886307,
    -0.005206424277275801,
    0.1530441790819168,
    -0.009127507917582989,
    -0.08122637122869492,
    0.002836155705153942,
    -0.14349165558815002,
    -0.3529041111469269,
    0.07373474538326263,
    -0.16617129743099213,
    -0.1586497575044632,
    -0.06207561492919922,
    -0.08981477469205856,
    -0.018964657559990883,
    -0.08680849522352219,
    0.01589708961546421,
    -0.1274646818637848,
    -0.3274504542350769,
    -0.14245758950710297,
    -0.06383775174617767,
    0.029317481443285942,
    0.08052146434783936,
    -0.047526583075523376,
    -0.1849977821111679,
    -0.08156353235244751,
    -0.49007919430732727,
    0.13672855496406555,
    -0.01627267710864544,
    0.02255767583847046,
    -0.16622355580329895,
    -0.07833779603242874,
    0.09796444326639175,
    0.1171628087759018,
    -0.1148931011557579,
    -0.05796196311712265,
    0.11349741369485855,
    0.00677949795499444,
    0.0065848627127707005,
    -0.011098853312432766,
    -0.12030325084924698,
    0.13555222749710083,
    0.04752610996365547,
    -0.08075329661369324,
    0.001783860265277326,
    0.17813800275325775,
    0.11944938451051712,
    0.02776864729821682,
    -0.08651521801948547,
    0.08006300032138824,
    -0.27465924620628357,
    -0.036790892481803894,
    -0.13750946521759033,
    0.024858785793185234
   ],
   [
    0.049105189740657806,
    0.013191641308367252,
    -0.04225960001349449,
    0.051375504583120346,
    0.01838008314371109,
    0.05364592745900154,
    0.13747571408748627,
    0.1637662649154663,
    0.06237718462944031,
    0.010745319537818432,
    0.11997737735509872,
    -0.11370734125375748,
    -0.13306760787963867,
    0.0005982249858789146,
    0.09614977240562439,
    0.022491266950964928,
    0.03040636144578457,
    -0.012937701307237148,
    -0.030042368918657303,
    0.055787038058042526,
    0.09473296999931335,
    0.0045325616374611855,
    0.19149690866470337,
    -0.10835499316453934,
    0.006083871237933636,
    0.10690585523843765,
    0.05123739317059517,
    -0.006001514382660389,
    0.04176932945847511,
    -0.1476951390504837,
    -0.0679761990904808,
    0.04579029604792595,
    0.010711535811424255,
    0.14922556281089783,
    -0.15340374410152435,
    0.006179519928991795,
    0.0772758424282074,
    -0.061789896339178085,
    0.03135121613740921,
    0.07541762292385101,
    -0.04053422063589096,
    -0.03675713390111923,
    0.10547975450754166,
    -0.08545377105474472,
    -0.12881867587566376,
    -0.0932469293475151,
    0.10053964704275131,
    -0.0904790386557579,
    -0.05700206756591797,
    -0.04207248240709305,
    0.051669202744960785,
    -0.03199384734034538,
    -0.04289925470948219,
    -0.030696161091327667,
    -0.013631913810968399,
    -0.1390761137008667,
    -0.02328680455684662,
    0.10474953800439835,
    0.057480089366436005,
    0.06872089952230453,
    -0.10849738866090775,
    -0.10206141322851181,
    0.09368672966957092,
    -0.08888757228851318,
    -0.11449829488992691,
    -0.08115439862012863,
    -0.0035217166878283024,
    0.10948102921247482,
    0.02134450525045395,
    0.005402806680649519,
    -0.07291864603757858,
    0.12885329127311707,
    0.11672453582286835,
    0.03221147879958153,
    -0.051255423575639725,
    -0.07620922476053238,
    0.14876671135425568,
    0.015500560402870178,
    -0.02328730747103691,
    -0.07123293727636337,
    -0.0984574630856514,
    0.07392722368240356,
    -0.01751420833170414,
    0.058213621377944946,
    -0.02931533008813858,
    -0.062242522835731506,
    -0.10923691838979721,
    0.05516950786113739,
    0.0874795913696289,
    -0.03176029771566391,
    -0.0855521410703659,
    0.06696925312280655,
    -0.0031708586029708385,
    0.05409616976976395,
    -0.05692504346370697,
    -0.007553319912403822,
    0.11530862748622894,
    -0.016486933454871178,
    0.045239873230457306,
    -0.05946044251322746,
    -0.09667625278234482,
    0.07771088182926178,
    -0.22207577526569366,
    -0.018121371045708656,
